app/controllers/exam_controller.rb

INSERT INTO `exams` (`code`, `created_at`, `updated_at`, `subject`, `exam_name`, `teacher`) VALUES ('', '2018-12-11 07:46:59', '2018-12-11 07:46:59', '', '', '')
---
  def create_exam
    exam_name = params[:exam_name]
    exam_code = params[:exam_code]
    exam_subject = params[:exam_subject]
    teacher = params[:teacher]
    exam = Exam.new
    exam.exam_name = exam_name
    exam.code = exam_code
    exam.subject = exam_subject
    exam.teacher = teacher
    if exam.save

SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
---
  def info_show
    id = params[:id]
    @exam = Exam.find id