app/controllers/users_controller.rb

  def create
    @user = Users.new user_params
    if @user.save
---
INSERT INTO `users` (`user_name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Nguyễn Xuân Tuấn', 'xuantuan@gmail.com', '123456789', '2018-12-04 04:27:23', '2018-12-04 04:27:23')

  def show
    @user = Users.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 16 LIMIT 1