app/controllers/user_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`user_name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('', '', '', '2018-11-21 18:44:20', '2018-11-21 18:44:20')

  def show
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1